ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/AM263P/CONTROLSS_ICLXBAR_CONTROLSS_502D4000h.xml
<module name="CONTROLSS" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="CONTROLSS_ICLXBAR0_G0" acronym="CONTROLSS_ICLXBAR0_G0" offset="256" width="32" description="ICL XBAR 0 Input Select.">
		<bitfield id="ICLXBAR0_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="ICL XBAR0 G0 input bit select. Input source is PWMA hr select1:PWMA hr bit[x] selected0:PWMA hr bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_ICLXBAR0_G1" acronym="CONTROLSS_ICLXBAR0_G1" offset="260" width="32" description="ICL XBAR 0 Input Select.">
		<bitfield id="ICLXBAR0_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="ICL XBAR0 G1 input bit select. Input source is PWMB hr select1:PWMB hr bit[x] selected0:PWMB hr bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_ICLXBAR0_G2" acronym="CONTROLSS_ICLXBAR0_G2" offset="264" width="32" description="ICL XBAR 0 Input Select.">
		<bitfield id="ICLXBAR0_G2_SEL" width="32" begin="31" end="0" resetval="0x0" description="ICL XBAR0 G2 input bit select. Input source is ICSS GPO selecty=0 when x =0 to 15, y=1 when x=16 to 311:ICSS_PORT[y].GPO[x] selected.0:ICSS_PORT[y].GPO[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_ICLXBAR1_G0" acronym="CONTROLSS_ICLXBAR1_G0" offset="320" width="32" description="ICL XBAR 1 Input Select.">
		<bitfield id="ICLXBAR1_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="ICL XBAR1 G0 input bit select. Input source is PWMA hr select1:PWMA hr bit[x] selected0:PWMA hr bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_ICLXBAR1_G1" acronym="CONTROLSS_ICLXBAR1_G1" offset="324" width="32" description="ICL XBAR 1 Input Select.">
		<bitfield id="ICLXBAR1_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="ICL XBAR1 G1 input bit select. Input source is PWMB hr select1:PWMB hr bit[x] selected0:PWMB hr bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_ICLXBAR1_G2" acronym="CONTROLSS_ICLXBAR1_G2" offset="328" width="32" description="ICL XBAR 1 Input Select.">
		<bitfield id="ICLXBAR1_G2_SEL" width="32" begin="31" end="0" resetval="0x0" description="ICL XBAR1 G2 input bit select. Input source is ICSS GPO selecty=0 when x =0 to 15, y=1 when x=16 to 311:ICSS_PORT[y].GPO[x] selected.0:ICSS_PORT[y].GPO[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_ICLXBAR2_G0" acronym="CONTROLSS_ICLXBAR2_G0" offset="384" width="32" description="ICL XBAR 2 Input Select.">
		<bitfield id="ICLXBAR2_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="ICL XBAR2 G0 input bit select. Input source is PWMA hr select1:PWMA hr bit[x] selected0:PWMA hr bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_ICLXBAR2_G1" acronym="CONTROLSS_ICLXBAR2_G1" offset="388" width="32" description="ICL XBAR 2 Input Select.">
		<bitfield id="ICLXBAR2_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="ICL XBAR2 G1 input bit select. Input source is PWMB hr select1:PWMB hr bit[x] selected0:PWMB hr bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_ICLXBAR2_G2" acronym="CONTROLSS_ICLXBAR2_G2" offset="392" width="32" description="ICL XBAR 2 Input Select.">
		<bitfield id="ICLXBAR2_G2_SEL" width="32" begin="31" end="0" resetval="0x0" description="ICL XBAR2 G2 input bit select. Input source is ICSS GPO selecty=0 when x =0 to 15, y=1 when x=16 to 311:ICSS_PORT[y].GPO[x] selected.0:ICSS_PORT[y].GPO[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_ICLXBAR3_G0" acronym="CONTROLSS_ICLXBAR3_G0" offset="448" width="32" description="ICL XBAR 3 Input Select.">
		<bitfield id="ICLXBAR3_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="ICL XBAR3 G0 input bit select. Input source is PWMA hr select1:PWMA hr bit[x] selected0:PWMA hr bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_ICLXBAR3_G1" acronym="CONTROLSS_ICLXBAR3_G1" offset="452" width="32" description="ICL XBAR 3 Input Select.">
		<bitfield id="ICLXBAR3_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="ICL XBAR3 G1 input bit select. Input source is PWMB hr select1:PWMB hr bit[x] selected0:PWMB hr bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_ICLXBAR3_G2" acronym="CONTROLSS_ICLXBAR3_G2" offset="456" width="32" description="ICL XBAR 3 Input Select.">
		<bitfield id="ICLXBAR3_G2_SEL" width="32" begin="31" end="0" resetval="0x0" description="ICL XBAR3 G2 input bit select. Input source is ICSS GPO selecty=0 when x =0 to 15, y=1 when x=16 to 311:ICSS_PORT[y].GPO[x] selected.0:ICSS_PORT[y].GPO[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_ICLXBAR4_G0" acronym="CONTROLSS_ICLXBAR4_G0" offset="512" width="32" description="ICL XBAR 4 Input Select.">
		<bitfield id="ICLXBAR4_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="ICL XBAR4 G0 input bit select. Input source is PWMA hr select1:PWMA hr bit[x] selected0:PWMA hr bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_ICLXBAR4_G1" acronym="CONTROLSS_ICLXBAR4_G1" offset="516" width="32" description="ICL XBAR 4 Input Select.">
		<bitfield id="ICLXBAR4_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="ICL XBAR4 G1 input bit select. Input source is PWMB hr select1:PWMB hr bit[x] selected0:PWMB hr bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_ICLXBAR4_G2" acronym="CONTROLSS_ICLXBAR4_G2" offset="520" width="32" description="ICL XBAR 4 Input Select.">
		<bitfield id="ICLXBAR4_G2_SEL" width="32" begin="31" end="0" resetval="0x0" description="ICL XBAR4 G2 input bit select. Input source is ICSS GPO selecty=0 when x =0 to 15, y=1 when x=16 to 311:ICSS_PORT[y].GPO[x] selected.0:ICSS_PORT[y].GPO[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_ICLXBAR5_G0" acronym="CONTROLSS_ICLXBAR5_G0" offset="576" width="32" description="ICL XBAR 5 Input Select.">
		<bitfield id="ICLXBAR5_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="ICL XBAR5 G0 input bit select. Input source is PWMA hr select1:PWMA hr bit[x] selected0:PWMA hr bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_ICLXBAR5_G1" acronym="CONTROLSS_ICLXBAR5_G1" offset="580" width="32" description="ICL XBAR 5 Input Select.">
		<bitfield id="ICLXBAR5_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="ICL XBAR5 G1 input bit select. Input source is PWMB hr select1:PWMB hr bit[x] selected0:PWMB hr bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_ICLXBAR5_G2" acronym="CONTROLSS_ICLXBAR5_G2" offset="584" width="32" description="ICL XBAR 5 Input Select.">
		<bitfield id="ICLXBAR5_G2_SEL" width="32" begin="31" end="0" resetval="0x0" description="ICL XBAR5 G2 input bit select. Input source is ICSS GPO selecty=0 when x =0 to 15, y=1 when x=16 to 311:ICSS_PORT[y].GPO[x] selected.0:ICSS_PORT[y].GPO[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_ICLXBAR6_G0" acronym="CONTROLSS_ICLXBAR6_G0" offset="640" width="32" description="ICL XBAR 6 Input Select.">
		<bitfield id="ICLXBAR6_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="ICL XBAR6 G0 input bit select. Input source is PWMA hr select1:PWMA hr bit[x] selected0:PWMA hr bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_ICLXBAR6_G1" acronym="CONTROLSS_ICLXBAR6_G1" offset="644" width="32" description="ICL XBAR 6 Input Select.">
		<bitfield id="ICLXBAR6_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="ICL XBAR6 G1 input bit select. Input source is PWMB hr select1:PWMB hr bit[x] selected0:PWMB hr bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_ICLXBAR6_G2" acronym="CONTROLSS_ICLXBAR6_G2" offset="648" width="32" description="ICL XBAR 6 Input Select.">
		<bitfield id="ICLXBAR6_G2_SEL" width="32" begin="31" end="0" resetval="0x0" description="ICL XBAR6 G2 input bit select. Input source is ICSS GPO selecty=0 when x =0 to 15, y=1 when x=16 to 311:ICSS_PORT[y].GPO[x] selected.0:ICSS_PORT[y].GPO[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_ICLXBAR7_G0" acronym="CONTROLSS_ICLXBAR7_G0" offset="704" width="32" description="ICL XBAR 7 Input Select.">
		<bitfield id="ICLXBAR7_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="ICL XBAR7 G0 input bit select. Input source is PWMA hr select1:PWMA hr bit[x] selected0:PWMA hr bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_ICLXBAR7_G1" acronym="CONTROLSS_ICLXBAR7_G1" offset="708" width="32" description="ICL XBAR 7 Input Select.">
		<bitfield id="ICLXBAR7_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="ICL XBAR7 G1 input bit select. Input source is PWMB hr select1:PWMB hr bit[x] selected0:PWMB hr bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_ICLXBAR7_G2" acronym="CONTROLSS_ICLXBAR7_G2" offset="712" width="32" description="ICL XBAR 7 Input Select.">
		<bitfield id="ICLXBAR7_G2_SEL" width="32" begin="31" end="0" resetval="0x0" description="ICL XBAR7 G2 input bit select. Input source is ICSS GPO selecty=0 when x =0 to 15, y=1 when x=16 to 311:ICSS_PORT[y].GPO[x] selected.0:ICSS_PORT[y].GPO[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_ICLXBAR8_G0" acronym="CONTROLSS_ICLXBAR8_G0" offset="768" width="32" description="ICL XBAR 8 Input Select.">
		<bitfield id="ICLXBAR8_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="ICL XBAR8 G0 input bit select. Input source is PWMA hr select1:PWMA hr bit[x] selected0:PWMA hr bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_ICLXBAR8_G1" acronym="CONTROLSS_ICLXBAR8_G1" offset="772" width="32" description="ICL XBAR 8 Input Select.">
		<bitfield id="ICLXBAR8_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="ICL XBAR8 G1 input bit select. Input source is PWMB hr select1:PWMB hr bit[x] selected0:PWMB hr bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_ICLXBAR8_G2" acronym="CONTROLSS_ICLXBAR8_G2" offset="776" width="32" description="ICL XBAR 8 Input Select.">
		<bitfield id="ICLXBAR8_G2_SEL" width="32" begin="31" end="0" resetval="0x0" description="ICL XBAR8 G2 input bit select. Input source is ICSS GPO selecty=0 when x =0 to 15, y=1 when x=16 to 311:ICSS_PORT[y].GPO[x] selected.0:ICSS_PORT[y].GPO[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_ICLXBAR9_G0" acronym="CONTROLSS_ICLXBAR9_G0" offset="832" width="32" description="ICL XBAR 9 Input Select.">
		<bitfield id="ICLXBAR9_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="ICL XBAR9 G0 input bit select. Input source is PWMA hr select1:PWMA hr bit[x] selected0:PWMA hr bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_ICLXBAR9_G1" acronym="CONTROLSS_ICLXBAR9_G1" offset="836" width="32" description="ICL XBAR 9 Input Select.">
		<bitfield id="ICLXBAR9_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="ICL XBAR9 G1 input bit select. Input source is PWMB hr select1:PWMB hr bit[x] selected0:PWMB hr bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_ICLXBAR9_G2" acronym="CONTROLSS_ICLXBAR9_G2" offset="840" width="32" description="ICL XBAR 9 Input Select.">
		<bitfield id="ICLXBAR9_G2_SEL" width="32" begin="31" end="0" resetval="0x0" description="ICL XBAR9 G2 input bit select. Input source is ICSS GPO selecty=0 when x =0 to 15, y=1 when x=16 to 311:ICSS_PORT[y].GPO[x] selected.0:ICSS_PORT[y].GPO[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_ICLXBAR10_G0" acronym="CONTROLSS_ICLXBAR10_G0" offset="896" width="32" description="ICL XBAR 10 Input Select.">
		<bitfield id="ICLXBAR10_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="ICL XBAR10 G0 input bit select. Input source is PWMA hr select1:PWMA hr bit[x] selected0:PWMA hr bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_ICLXBAR10_G1" acronym="CONTROLSS_ICLXBAR10_G1" offset="900" width="32" description="ICL XBAR 10 Input Select.">
		<bitfield id="ICLXBAR10_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="ICL XBAR10 G1 input bit select. Input source is PWMB hr select1:PWMB hr bit[x] selected0:PWMB hr bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_ICLXBAR10_G2" acronym="CONTROLSS_ICLXBAR10_G2" offset="904" width="32" description="ICL XBAR 10 Input Select.">
		<bitfield id="ICLXBAR10_G2_SEL" width="32" begin="31" end="0" resetval="0x0" description="ICL XBAR10 G2 input bit select. Input source is ICSS GPO selecty=0 when x =0 to 15, y=1 when x=16 to 311:ICSS_PORT[y].GPO[x] selected.0:ICSS_PORT[y].GPO[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_ICLXBAR11_G0" acronym="CONTROLSS_ICLXBAR11_G0" offset="960" width="32" description="ICL XBAR 11 Input Select.">
		<bitfield id="ICLXBAR11_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="ICL XBAR11 G0 input bit select. Input source is PWMA hr select1:PWMA hr bit[x] selected0:PWMA hr bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_ICLXBAR11_G1" acronym="CONTROLSS_ICLXBAR11_G1" offset="964" width="32" description="ICL XBAR 11 Input Select.">
		<bitfield id="ICLXBAR11_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="ICL XBAR11 G1 input bit select. Input source is PWMB hr select1:PWMB hr bit[x] selected0:PWMB hr bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_ICLXBAR11_G2" acronym="CONTROLSS_ICLXBAR11_G2" offset="968" width="32" description="ICL XBAR 11 Input Select.">
		<bitfield id="ICLXBAR11_G2_SEL" width="32" begin="31" end="0" resetval="0x0" description="ICL XBAR11 G2 input bit select. Input source is ICSS GPO selecty=0 when x =0 to 15, y=1 when x=16 to 311:ICSS_PORT[y].GPO[x] selected.0:ICSS_PORT[y].GPO[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_ICLXBAR12_G0" acronym="CONTROLSS_ICLXBAR12_G0" offset="1024" width="32" description="ICL XBAR 12 Input Select.">
		<bitfield id="ICLXBAR12_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="ICL XBAR12 G0 input bit select. Input source is PWMA hr select1:PWMA hr bit[x] selected0:PWMA hr bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_ICLXBAR12_G1" acronym="CONTROLSS_ICLXBAR12_G1" offset="1028" width="32" description="ICL XBAR 12 Input Select.">
		<bitfield id="ICLXBAR12_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="ICL XBAR12 G1 input bit select. Input source is PWMB hr select1:PWMB hr bit[x] selected0:PWMB hr bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_ICLXBAR12_G2" acronym="CONTROLSS_ICLXBAR12_G2" offset="1032" width="32" description="ICL XBAR 12 Input Select.">
		<bitfield id="ICLXBAR12_G2_SEL" width="32" begin="31" end="0" resetval="0x0" description="ICL XBAR12 G2 input bit select. Input source is ICSS GPO selecty=0 when x =0 to 15, y=1 when x=16 to 311:ICSS_PORT[y].GPO[x] selected.0:ICSS_PORT[y].GPO[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_ICLXBAR13_G0" acronym="CONTROLSS_ICLXBAR13_G0" offset="1088" width="32" description="ICL XBAR 13 Input Select.">
		<bitfield id="ICLXBAR13_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="ICL XBAR13 G0 input bit select. Input source is PWMA hr select1:PWMA hr bit[x] selected0:PWMA hr bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_ICLXBAR13_G1" acronym="CONTROLSS_ICLXBAR13_G1" offset="1092" width="32" description="ICL XBAR 13 Input Select.">
		<bitfield id="ICLXBAR13_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="ICL XBAR13 G1 input bit select. Input source is PWMB hr select1:PWMB hr bit[x] selected0:PWMB hr bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_ICLXBAR13_G2" acronym="CONTROLSS_ICLXBAR13_G2" offset="1096" width="32" description="ICL XBAR 13 Input Select.">
		<bitfield id="ICLXBAR13_G2_SEL" width="32" begin="31" end="0" resetval="0x0" description="ICL XBAR13 G2 input bit select. Input source is ICSS GPO selecty=0 when x =0 to 15, y=1 when x=16 to 311:ICSS_PORT[y].GPO[x] selected.0:ICSS_PORT[y].GPO[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_ICLXBAR14_G0" acronym="CONTROLSS_ICLXBAR14_G0" offset="1152" width="32" description="ICL XBAR 14 Input Select.">
		<bitfield id="ICLXBAR14_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="ICL XBAR14 G0 input bit select. Input source is PWMA hr select1:PWMA hr bit[x] selected0:PWMA hr bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_ICLXBAR14_G1" acronym="CONTROLSS_ICLXBAR14_G1" offset="1156" width="32" description="ICL XBAR 14 Input Select.">
		<bitfield id="ICLXBAR14_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="ICL XBAR14 G1 input bit select. Input source is PWMB hr select1:PWMB hr bit[x] selected0:PWMB hr bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_ICLXBAR14_G2" acronym="CONTROLSS_ICLXBAR14_G2" offset="1160" width="32" description="ICL XBAR 14 Input Select.">
		<bitfield id="ICLXBAR14_G2_SEL" width="32" begin="31" end="0" resetval="0x0" description="ICL XBAR14 G2 input bit select. Input source is ICSS GPO selecty=0 when x =0 to 15, y=1 when x=16 to 311:ICSS_PORT[y].GPO[x] selected.0:ICSS_PORT[y].GPO[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_ICLXBAR15_G0" acronym="CONTROLSS_ICLXBAR15_G0" offset="1216" width="32" description="ICL XBAR 15 Input Select .">
		<bitfield id="ICLXBAR15_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="ICL XBAR15 G0 input bit select. Input source is PWMA hr select1:PWMA hr bit[x] selected0:PWMA hr bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_ICLXBAR15_G1" acronym="CONTROLSS_ICLXBAR15_G1" offset="1220" width="32" description="ICL XBAR 15 Input Select .">
		<bitfield id="ICLXBAR15_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="ICL XBAR15 G1 input bit select. Input source is PWMB hr select1:PWMB hr bit[x] selected0:PWMB hr bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_ICLXBAR15_G2" acronym="CONTROLSS_ICLXBAR15_G2" offset="1224" width="32" description="ICL XBAR 15 Input Select .">
		<bitfield id="ICLXBAR15_G2_SEL" width="32" begin="31" end="0" resetval="0x0" description="ICL XBAR15 G2 input bit select. Input source is ICSS GPO selecty=0 when x =0 to 15, y=1 when x=16 to 311:ICSS_PORT[y].GPO[x] selected.0:ICSS_PORT[y].GPO[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register>
</module>